/*

localstorage 활용
방문록 : 1. 방문내용 2.작성일


*/

let 방문목록 =[
    {내용: `안녕하세요`,작성일 : `2024-5-30`},
    {내용: `안녕하세`,작성일 : `2024-5-30`},
    {내용: `안녕하`,작성일 : `2024-5-30`}
]

function 등록함수() {
    let 내용 = document.querySelector(`#내용`).value;

    let date = new Date();
    let 작성일 = `${ date.getFullYear()}-${date.getMonth()+1}-${date.getDate()}`

    let 방문 = { 내용 : 내용 , 작성일 : 작성일 };


////////////////////////////////////////////////////////////
    let 방문목록 = JSON.parse(localStorage.getItem(`방문목록`));
    if (방문목록 == null) {방문목록 = [];}
////////////////////////////////////////////////////////////
//얘가 빈 깡통이라 저장소에 있는걸 가져와서 하나 추가 저장하고 다시 저장소에저장


    방문목록.push( 방문 );
////////////////////////////////////////////////////////////
    localStorage.setItem(`방문목록`, JSON.stringify(방문목록));
////////////////////////////////////////////////////////////

    출력함수();
}

출력함수();
function 출력함수() { 
////////////////////////////////////////////////////////////
    방문목록 = JSON.parse(localStorage.getItem(`방문목록`));
    if (방문목록 == null) {return;}
////////////////////////////////////////////////////////////




    let 출력구역 = document.querySelector(`#출력구역`)

    let html = ''; 

    for (let i = 0; i<방문목록.length ; i++){
        html += ` <div>${방문목록[i].내용}${방문목록[i].작성일}</div>`

    }
    출력구역.innerHTML=html;
}

