/*

JS데이터
    1.문자
     <선언> let 문자 = `안녕`
     <호출> 변수명
     <수정> 변수명 =`자바`
    2. 숫자
    3. 불리언/논리
    4. undifined
    5. 배열(객체) : [데이터, 데이터, 데이터]
     - 여러 데이터를 하나의 데이터로 묶는 형식, 저장 순서(인덱스)
     <선언> let 변수명 = [`안녕`, 2, true,{}]
     <호출> 1.변수명 2.변수명[인덱스]
     <수정> 변수명 = [`자바`, 456, false, {}] 2.변수명[인덱스] = false
     <삽입삭제> 1.변수명.push() 2.변수명.splice()
     <검색> 1. 변수명.index() 2.for(let i = 0 ; i < 변수명.length ; i++){}

    6. 함수(객체) : function(){}
     - 여러 실행문;을 하나로 묶은 형식 1.선언적 2. 익명 3. 화살표
     <선언> function 함수명(매개변수){실행문; return;}
     <호출> JS : 함수명();    HTTL : <마크업 이벤트속성=`함수명()`>

    7. 객체 : {속성명 : 데이터,속성명 : 데이터,속성명 : 데이터}
     - 여러 데이터를 속성명과 데이터를 한쌍으로 이루어진 여러 쌍을 묶은 형식, 속성명
     <선언>




JS 데이터 1개를 저장하는 곳 : let, const


라이브러리 / 미리 만들어진 함수 또는 객체
1. 내장 라이브러리(별도 설치가 없어도 사용 가능한 함수 또는 객체)
 1. console.log(객체)
 2. Math(객체)
  random Math.random()
 3. 배열(객체)
  배열.push(), 배열.splice() 배열.index(), 배열.length
 3. 문자(일부객체로 승급)



*/